PCIS_prod/src/DataProcessors/ДиаграммаГантаПроекта/ДиаграммаГантаПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДиаграммаГантаПроекта</name>
</mdclass:DataProcessor>

PCIS_prod/src/InformationRegisters/ХодВыполненияПроекта/ХодВыполненияПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияПроекта</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ХодВыполненияЭтапа/ХодВыполненияЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияЭтапа</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Этап</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/Catalogs/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проект</name>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Этап/Этап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Этап</name>
  <owners>Catalog.Проект</owners>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЭтапа</name>
    <type>
      <types>EnumRef.ЦветЭтапа</types>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задача</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Этап</owners>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/DataProcessors/ДиаграммаГантаПроекта/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()  
	
	ЭтаФорма.Заголовок = Проект.Наименование;
					
КонецПроцедуры

Процедура УстановитьПериодичность(ДиаграммаГанта) 
	
	
	ПервыйЭлемент = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
	ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.Квартал;
	ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	ПервыйЭлемент.Формат = "ДФ='к, гггг '";
	
	Элемент = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	Элемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
	Элемент.Кратность = 1;
	Элемент.Формат = "Дф='ММММ'";
	Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.НетЛинии, 1);
	
	ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	ДиаграммаГанта.КратностьПериодическогоВарианта = 1;
	ДиаграммаГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Год;
	
	
КонецПроцедуры    


Процедура УдалитьШкалы(ДиагарммаГанта)
	ЭлементШкалыВремени = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
	
	Для сч = 1 по ЭлементШкалыВремени.Количество() - 1 Цикл
		ЭлементШкалыВремени.Удалить(ЭлементШкалыВремени[1]);
	КонецЦикла;
	
КонецПроцедуры    


Процедура ПостроитьПроект(Проект)  
	
	СерияПлан = ДиаграммаГанта.Серии.Добавить();
	СерияПлан.Текст = "План";
	СерияПлан.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияФакт = ДиаграммаГанта.Серии.Добавить();
	СерияФакт.Текст = "Факт";
	СерияФакт.Цвет = WebЦвета.КрасноФиолетовый;

	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Справочники.Проект.НайтиПоНаименованию(Проект).ПланДатаНачала, 
											Справочники.Проект.НайтиПоНаименованию(Проект).ПланДатаОкончания);
											
											
											
	СправочникПроекта = Справочники.Проект.НайтиПоНаименованию(Проект);  
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХодВыполненияПроекта.Проект КАК Проект,
		|	ХодВыполненияПроекта.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ХодВыполненияПроекта.СтатусВыполнения КАК СтатусВыполнения,
		|	ХодВыполненияПроекта.ФактДатаНачала КАК ФактДатаНачала,
		|	ХодВыполненияПроекта.ФактДатаОкончания КАК ФактДатаОкончания
		|ИЗ
		|	РегистрСведений.ХодВыполненияПроекта КАК ХодВыполненияПроекта";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проект.Наименование = Проект Тогда
			ПроцентВыполнения = Выборка.ПроцентВыполнения;
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	Точка = ДиаграммаГанта.Точки.Добавить();
	Точка.Текст = Проект + ", " + ПроцентВыполнения + "%";
	Точка.Значение = Проект;
	Точка.Картинка = БиблиотекаКартинок.СводнаяДиаграмма;    
	
	Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПлан);  
	
	Интервал = Значение.Добавить();
	Интервал.Цвет = WebЦвета.Красный;
	Интервал.Начало = СправочникПроекта.ПланДатаНачала;
	Интервал.Конец = СправочникПроекта.ПланДатаОкончания;
	
	ПостроитьЭтапы(СправочникПроекта, СерияПлан, СерияФакт);
		
КонецПроцедуры  

Процедура ПостроитьЭтапы(Проект, СерияПлан, СерияФакт)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	
	    |	Этап.Ссылка КАК Ссылка
	    |ИЗ
	    |	Справочник.Этап КАК Этап
	
	    |ГДЕ
	    |	Этап.Владелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", Проект);
	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл 
		СправочникЭтапа = Результат.Ссылка;  
		Этап = СправочникЭтапа.Наименование;   
		
		
		  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХодВыполненияЭтапа.Этап КАК Этап,
		|	ХодВыполненияЭтапа.Проект КАК Проект,
		|	ХодВыполненияЭтапа.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ХодВыполненияЭтапа.СтатусВыполнения КАК СтатусВыполнения,
		|	ХодВыполненияЭтапа.ФактДатаНачала КАК ФактДатаНачала,
		|	ХодВыполненияЭтапа.ФактДатаОкончания КАК ФактДатаОкончания
		|ИЗ
		|	РегистрСведений.ХодВыполненияЭтапа КАК ХодВыполненияЭтапа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проект.Наименование = Проект.Наименование И Выборка.Этап.Наименование = Этап Тогда
			ПроцентВыполнения = Выборка.ПроцентВыполнения;
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
				
		Точка = ДиаграммаГанта.УстановитьТочку(Этап, Проект.Наименование);
		Точка.Текст = Этап + ", " + ПроцентВыполнения + "%";
		Точка.Картинка = БиблиотекаКартинок.БизнесПроцесс;    
	
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПлан);  
	
		Интервал = Значение.Добавить();
		Интервал.Начало = СправочникЭтапа.ПланДатаНачала;
		Интервал.Конец = СправочникЭтапа.ПланДатаОкончания; 
		
		ПостроитьЗадачи(СправочникЭтапа, СерияПлан, СерияФакт);

	КонецЦикла;    
	Точка = ДиаграммаГанта.УстановитьТочку(Проект.Наименование);
	ДиаграммаГанта.РазвернутьТочку(Точка, Истина);
	
КонецПроцедуры

Процедура ПостроитьЗадачи(Этап, СерияПлан, СерияФакт)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	
	    |	Задача.Ссылка КАК Ссылка
	    |ИЗ
	    |	Справочник.Задача КАК Задача
	
	    |ГДЕ
	    |	Задача.Владелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", Этап);
	Результат = Запрос.Выполнить().Выбрать();
	
	
	Пока Результат.Следующий() Цикл   
		
		СправочникЗадачи = Результат.Ссылка;       
		Задача = СправочникЗадачи.Наименование;
		ЗадачаЭтап = Этап.Наименование + Задача; 
					
				
		Точка = ДиаграммаГанта.УстановитьТочку(ЗадачаЭтап, Этап.Наименование);
		Точка.Текст = Задача;
		Точка.Картинка = БиблиотекаКартинок.Реквизит;    
	
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияПлан);  
	
		Интервал = Значение.Добавить();
		Интервал.Начало = СправочникЗадачи.ПланДатаНачала;
		Интервал.Конец = СправочникЗадачи.ПланДатаОкончания;  
		
		
		
	КонецЦикла;
	Точка = ДиаграммаГанта.УстановитьТочку(Этап.Наименование);
	ДиаграммаГанта.РазвернутьТочку(Точка, Истина);

	
КонецПроцедуры

Процедура УстановитьТекстЗначения(Текст, ДатаНачала, ДатаОкончания)
	Текст = Формат(ДатаНачала, "ДЛФ=DDT") + " - " + Формат(ДатаОкончания, "ДЛФ=DDT");	
КонецПроцедуры

&НаСервере
Процедура ПроектПриИзмененииНаСервере()
	ПриОткрытииНаСервере(); 
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить(); 
	УдалитьШкалы(ДиаграммаГанта);
	УстановитьПериодичность(ДиаграммаГанта);
	ПостроитьПроект(Проект.Наименование);
	  
		 
	ДиаграммаГанта.Обновление = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
КонецПроцедуры
